#+title:  i3 literate configuration file
#+author: emil lenz
#+email:  emillenz@protonmail.com
#+date:   [2023-05-15] <- ([2024-11-15] version: marks & literate style)
#+property: header-args:conf :tangle config :noweb yes :comments link

* workspaces
- the idea is to bind to the abstract function of the program, and not to the specific instance itself => if a different program is used, the functionality and bindings remain the same.  (eg: vim instead of emacs).
- if you are forced to work with a desktop environment, you can easily replicate this config by manually putting clients on separate workspaces and using [[kbd:][MOD+<number>]] to switch.
- workspace assigned programs are started automatically by the ~autostart~ script and a binding to open them client-server style when it makes sense (if accidentally closed), all other apps are to be opened via dmenu desktop laucher.  ensuring these programs are always running just reduces mental overhead and startup time.
- the parenthesis around the commands are required, otherwise undefined behaviour.
- we use per program workspaces and not just jumping to a specific program, since this alings more with the full focus workflow.  when we are working on something, we want to focus in on it, not multitask between mutiple different windows.
- workspaces allow multiple windows of the same class to be opened on the same workspace (eg. multiple instances of zathura).
- get window title & class information using: ~xprop~
- for windows that are not assigned to workspaces it is most efficient to use the dmenu ~window-menu~.

#+name: workspaces
#+begin_src elisp
(require 'dash)

(mapconcat #'identity
	   (->> '(("all" ".")
		  ("edit" "Emacs"
		   "emacsclient --reuse-frame || (emacs --daemon && emacsclient --create-frame)"
		   t)
		  ("read" "Zathura")
		  ("term" "Alacritty" "alacritty" t)
		  ("web" "firefox" "firefox"))

		(-map (lambda (tuple)
			(-let* (((name class cmd gaps?) tuple)
				(key (substring name 0 1)))
			  (mapconcat #'identity
				     (remove nil
					     (list (format "for_window [class=\"%s\"] move container to workspace %s" class name)
						   (format "bindsym $MOD+%s workspace %s" key name)
						   (when cmd (format "bindsym $MOD+shift+%s $SHCMD %s" key cmd))
						   (when gaps? (format "workspace %s gaps horizontal $GAPSIZE" name))))
				     "\n")))))
	   "\n")
#+end_src

#+RESULTS: workspaces
#+begin_example
for_window [class="."] move container to workspace all
bindsym $MOD+a workspace all
for_window [class="Emacs"] move container to workspace edit
bindsym $MOD+e workspace edit
bindsym $MOD+shift+e $SHCMD emacsclient --reuse-frame || (emacs --daemon && emacsclient --create-frame)
workspace edit gaps horizontal $GAPSIZE
for_window [class="Zathura"] move container to workspace read
bindsym $MOD+r workspace read
for_window [class="Alacritty"] move container to workspace term
bindsym $MOD+t workspace term
bindsym $MOD+shift+t $SHCMD alacritty
workspace term gaps horizontal $GAPSIZE
for_window [class="firefox"] move container to workspace web
bindsym $MOD+w workspace web
bindsym $MOD+shift+w $SHCMD firefox
#+end_example

(read: ~M-x info-display-manual org~ chapter: =16 working with source code=, if you don't know what this magic is doing)
#+begin_src conf
<<workspaces()>>
#+end_src

- HACK :: must come after specific workspaces (applies to all windows).
#+begin_src conf
for_window [all] focus, title_window_icon no
#+end_src

